# GetDefaultOpacityN

```pascal
PROCEDURE GetDefaultOpacityN(
				VAR outPenOpacity  : INTEGER;
				VAR outFillOpacity : INTEGER);
```

```python
def vs.GetDefaultOpacityN():
    return (outPenOpacity, outFillOpacity)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outPenOpacity|INTEGER|   |
|outFillOpacity|INTEGER|   |

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes